Revit 2027 API
BuiltInFailures.RebarFailures.RebarShapeFailure Property
 Can't solve Rebar Shape.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId RebarShapeFailure { get; }
Public Shared ReadOnly Property RebarShapeFailure As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ RebarShapeFailure {
	FailureDefinitionId^ get ();
}
static member RebarShapeFailure : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RebarFailures Class
Autodesk.Revit.DB Namespace